0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.22;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    
    obstacle
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
}
