0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.06;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;       // 1% turbulent intensity
        value           $internalField;
    }

    outlet
    {
	type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;       // 1% turbulent intensity
        value           $internalField;
    }

    walls
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    obstacle
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
}
