0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e05;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value		$internalField;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    walls
    {
        type            zeroGradient;
    }
    
    obstacle
    {
    	type		zeroGradient;
    }

    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
}

