constant/transportProperties
FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	object		transportProperties;
}

transportModel	Newtonian;

nu		1.7894e-05;

rho		1.225;
