system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale	1;

vertices
(
	(0   0   0)
	(40  0   0)
	(0   20  0)
	(40  20  0)
	(0   0   0.1)
	(40  0   0.1)
	(0   20  0.1)
	(40  20  0.1)
);

blocks
(
	hex (0 1 3 2 4 5 7 6) (40 20 1) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces 
		(
			(0 2 6 4)
		);
	}
	
	outlet
	{
		type patch;
		faces 
		(
			(1 3 7 5)
		);
	}
	
	walls
	{
		type wall;
		faces 
		(
			(0 1 5 4)
			(2 3 7 6)
		);
	}
	
	fronts
	{
		type symmetryPlane;
		faces 
		(
			(0 1 3 2)
		);
	}
	
	backs
	{
		type symmetryPlane;
		faces
		( 
			(4 5 7 6)
		);
	}
);
