system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1;

writeControl    adjustable;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           3;

functions
{
forces
{
    type            forces;
    libs            (forces);

    writeControl    timeStep;
    writeInterval   10;
    log             false;

    patches         (obstacle);
    rho             rhoInf;
    rhoInf          1.225;
    CofR            (0.4974612746 -0.01671895744 0.125);
}
}
