system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            false;
addLayers       true;

mergeTolerance 1e-6;

geometry 
{
	obstacle.stl
	{
		type triSurfaceMesh;
		name obstacle;
	}
	refinementBox
	{
		type box;
		min (5   5   0);
		max (15 15 0.1);
	}
}
	
castellatedMeshControls
{
   	        maxLocalCells 100000;
		maxGlobalCells 2000000;
   		minRefinementCells 100;
   		nCellsBetweenLevels 6;
  		features ();
  		refinementSurfaces
    		{
        		obstacle
        		{
            			level (5 5);
        		}
    		}
    		resolveFeatureAngle 30;
		refinementRegions
    		{
        		refinementBox
        		{
            		mode inside;
            		levels ((1e15 2));
        		}
    		}
    		allowFreeStandingZoneFaces true;
		locationInMesh (0.25 0.25 0.02);
}

snapControls
{
    		nSmoothPatch 3;
        	tolerance    0.1;
            	nSolveIter 30;
                nRelaxIter 5;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        obstacle
        {
            nSurfaceLayers 3;
        }
    }
        	expansionRatio 1.3;
            	finalLayerThickness 0.7;
                minThickness 0.25;
                nGrow 0;
                featureAngle 60;
                nRelaxIter 5;
                nSmoothSurfaceNormals 1;
                nSmoothNormals 3;
                nSmoothThickness 10;
                maxFaceThicknessRatio 0.5;
                maxThicknessToMedialRatio 0.3;
                minMedialAxisAngle 90;
                nBufferCellsNoExtrude 0;
                nLayerIter 50;
                                                            
}

meshQualityControls
{

    maxNonOrtho 65;


    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    
    maxConcave 80;


    minFlatness 0.5;

    minVol 1e-13;
    minTetQuality 1e-30;


    minArea -1;


    minTwist 0.02;


    minDeterminant 0.001;


    minFaceWeight 0.02;


    minVolRatio 0.01;


    minTriangleTwist -1;



    nSmoothScale 4;

    errorReduction 0.75;
}



